---
kind: method
id: M:Autodesk.Revit.DB.FillPatternElement.GetFillPattern
source: html/ab2f6e79-2aef-2cac-0d53-bb2651ced0bc.htm
---
# Autodesk.Revit.DB.FillPatternElement.GetFillPattern Method

Gets the FillPattern associated to this element.

## Syntax (C#)
```csharp
public FillPattern GetFillPattern()
```

## Returns
A copy of FillPattern object.